Thanks, @doublefelix7. Identified this problem.

Probably, TFLint seems to have a different `path.root` result from Terraform because it rebuilds a child module as a root module. The following is a minimal example:

**main.tf**
```hcl
provider "aws" {
  region = "us-east-1"
}

module "ec2" {
  source = "./module"

  suffix = "t2.micro"
}
```

**module/ec2.tf**
```hcl
variable "suffix" {}

resource "aws_instance" "foo" {
  ami = "ami-12345678"
  instance_type = "${path.root}/${var.suffix}"
}
```

**Terraform output**
```
  + resource "aws_instance" "foo" {
      + ami                          = "ami-12345678"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "./t2.micro"
```

**TFLint output**
```
Error: "module/t2.micro" is an invalid value as instance_type (aws_instance_invalid_type)

  on main.tf line 8:
   8:   suffix = "t2.micro"

Callers:
   main.tf:8,12-22
   module/ec2.tf:5,19-47
```

Until this bug is fixed, as a workaround, please disable the module inspection or set the corresponding module to `ignore_module`.
https://github.com/terraform-linters/tflint/blob/v0.15.5/docs/guides/config.md#ignore_module